MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11D0AGN20000/mcu.h
/*******************************************************************************
* SWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDOGLOAD;
        struct {
          union {
            __IO uint16_t WDOGLOADL;
            struct {
              __IO uint8_t WDOGLOADLL;
              __IO uint8_t WDOGLOADLH;
            };
          };
          union {
            __IO uint16_t WDOGLOADH;
            struct {
              __IO uint8_t WDOGLOADHL;
              __IO uint8_t WDOGLOADHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGVALUE;
        struct {
          union {
            __IO uint16_t WDOGVALUEL;
            struct {
              __IO uint8_t WDOGVALUELL;
              __IO uint8_t WDOGVALUELH;
            };
          };
          union {
            __IO uint16_t WDOGVALUEH;
            struct {
              __IO uint8_t WDOGVALUEHL;
              __IO uint8_t WDOGVALUEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGCONTROL;
        stc_swwdt_wdogcontrol_field_t WDOGCONTROL_f;
        struct {
          union {
            __IO uint16_t WDOGCONTROLL;
            struct {
              __IO uint8_t WDOGCONTROLLL;
              __IO uint8_t WDOGCONTROLLH;
            };
          };
          union {
            __IO uint16_t WDOGCONTROLH;
            struct {
              __IO uint8_t WDOGCONTROLHL;
              __IO uint8_t WDOGCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGINTCLR;
        struct {
          union {
            __IO uint16_t WDOGINTCLRL;
            struct {
              __IO uint8_t WDOGINTCLRLL;
              __IO uint8_t WDOGINTCLRLH;
            };
          };
          union {
            __IO uint16_t WDOGINTCLRH;
            struct {
              __IO uint8_t WDOGINTCLRHL;
              __IO uint8_t WDOGINTCLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGRIS;
        stc_swwdt_wdogris_field_t WDOGRIS_f;
        struct {
          union {
            __IO uint16_t WDOGRISL;
            struct {
              __IO uint8_t WDOGRISLL;
              __IO uint8_t WDOGRISLH;
            };
          };
          union {
            __IO uint16_t WDOGRISH;
            struct {
              __IO uint8_t WDOGRISHL;
              __IO uint8_t WDOGRISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t WDOGSPMC;
        stc_swwdt_wdogspmc_field_t WDOGSPMC_f;
        struct {
          union {
            __IO uint16_t WDOGSPMCL;
            struct {
              __IO uint8_t WDOGSPMCLL;
              __IO uint8_t WDOGSPMCLH;
            };
          };
          union {
            __IO uint16_t WDOGSPMCH;
            struct {
              __IO uint8_t WDOGSPMCHL;
              __IO uint8_t WDOGSPMCHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[3044];
    union {
        __IO uint32_t WDOGLOCK;
        struct {
          union {
            __IO uint16_t WDOGLOCKL;
            struct {
              __IO uint8_t WDOGLOCKLL;
              __IO uint8_t WDOGLOCKLH;
            };
          };
          union {
            __IO uint16_t WDOGLOCKH;
            struct {
              __IO uint8_t WDOGLOCKHL;
              __IO uint8_t WDOGLOCKHH;
            };
          };
        };
    };
} FM_SWWDT_TypeDef, FM0P_SWWDT_TypeDef;

/*******************************************************************************
* UNIQUE_ID_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t UIDR0;
        stc_unique_id_uidr0_field_t UIDR0_f;
        struct {
          union {
            __IO uint16_t UIDR0L;
            struct {
              __IO uint8_t UIDR0LL;
              __IO uint8_t UIDR0LH;
            };
          };
          union {
            __IO uint16_t UIDR0H;
            struct {
              __IO uint8_t UIDR0HL;
              __IO uint8_t UIDR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t UIDR1;
        stc_unique_id_uidr1_field_t UIDR1_f;
        struct {
          union {
            __IO uint16_t UIDR1L;
            struct {
              __IO uint8_t UIDR1LL;
              __IO uint8_t UIDR1LH;
            };
          };
          union {
            __IO uint16_t UIDR1H;
            struct {
              __IO uint8_t UIDR1HL;
              __IO uint8_t UIDR1HH;
            };
          };
        };
    };
} FM_UNIQUE_ID_TypeDef, FM0P_UNIQUE_ID_TypeDef;

/*******************************************************************************
* VIR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t VIR00;
        struct {
          union {
            __IO uint16_t VIR00L;
            struct {
              __IO uint8_t VIR00LL;
              __IO uint8_t VIR00LH;
            };
          };
          union {
            __IO uint16_t VIR00H;
            struct {
              __IO uint8_t VIR00HL;
              __IO uint8_t VIR00HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR01;
        struct {
          union {
            __IO uint16_t VIR01L;
            struct {
              __IO uint8_t VIR01LL;
              __IO uint8_t VIR01LH;
            };
          };
          union {
            __IO uint16_t VIR01H;
            struct {
              __IO uint8_t VIR01HL;
              __IO uint8_t VIR01HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR02;
        struct {
          union {
            __IO uint16_t VIR02L;
            struct {
              __IO uint8_t VIR02LL;
              __IO uint8_t VIR02LH;
            };
          };
          union {
            __IO uint16_t VIR02H;
            struct {
              __IO uint8_t VIR02HL;
              __IO uint8_t VIR02HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR03;
        struct {
          union {
            __IO uint16_t VIR03L;
            struct {
              __IO uint8_t VIR03LL;
              __IO uint8_t VIR03LH;
            };
          };
          union {
            __IO uint16_t VIR03H;
            struct {
              __IO uint8_t VIR03HL;
              __IO uint8_t VIR03HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR04;
        struct {
          union {
            __IO uint16_t VIR04L;
            struct {
              __IO uint8_t VIR04LL;
              __IO uint8_t VIR04LH;
            };
          };
          union {
            __IO uint16_t VIR04H;
            struct {
              __IO uint8_t VIR04HL;
              __IO uint8_t VIR04HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR05;
        struct {
          union {
            __IO uint16_t VIR05L;
            struct {
              __IO uint8_t VIR05LL;
              __IO uint8_t VIR05LH;
            };
          };
          union {
            __IO uint16_t VIR05H;
            struct {
              __IO uint8_t VIR05HL;
              __IO uint8_t VIR05HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR06;
        struct {
          union {
            __IO uint16_t VIR06L;
            struct {
              __IO uint8_t VIR06LL;
              __IO uint8_t VIR06LH;
            };
          };
          union {
            __IO uint16_t VIR06H;
            struct {
              __IO uint8_t VIR06HL;
              __IO uint8_t VIR06HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR07;
        struct {
          union {
            __IO uint16_t VIR07L;
            struct {
              __IO uint8_t VIR07LL;
              __IO uint8_t VIR07LH;
            };
          };
          union {
            __IO uint16_t VIR07H;
            struct {
              __IO uint8_t VIR07HL;
              __IO uint8_t VIR07HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR08;
        struct {
          union {
            __IO uint16_t VIR08L;
            struct {
              __IO uint8_t VIR08LL;
              __IO uint8_t VIR08LH;
            };
          };
          union {
            __IO uint16_t VIR08H;
            struct {
              __IO uint8_t VIR08HL;
              __IO uint8_t VIR08HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR09;
        struct {
          union {
            __IO uint16_t VIR09L;
            struct {
              __IO uint8_t VIR09LL;
              __IO uint8_t VIR09LH;
            };
          };
          union {
            __IO uint16_t VIR09H;
            struct {
              __IO uint8_t VIR09HL;
              __IO uint8_t VIR09HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR10;
        struct {
          union {
            __IO uint16_t VIR10L;
            struct {
              __IO uint8_t VIR10LL;
              __IO uint8_t VIR10LH;
            };
          };
          union {
            __IO uint16_t VIR10H;
            struct {
              __IO uint8_t VIR10HL;
              __IO uint8_t VIR10HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR11;
        struct {
          union {
            __IO uint16_t VIR11L;
            struct {
              __IO uint8_t VIR11LL;
              __IO uint8_t VIR11LH;
            };
          };
          union {
            __IO uint16_t VIR11H;
            struct {
              __IO uint8_t VIR11HL;
              __IO uint8_t VIR11HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR12;
        struct {
          union {
            __IO uint16_t VIR12L;
            struct {
              __IO uint8_t VIR12LL;
              __IO uint8_t VIR12LH;
            };
          };
          union {
            __IO uint16_t VIR12H;
            struct {
              __IO uint8_t VIR12HL;
              __IO uint8_t VIR12HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR13;
        struct {
          union {
            __IO uint16_t VIR13L;
            struct {
              __IO uint8_t VIR13LL;
              __IO uint8_t VIR13LH;
            };
          };
          union {
            __IO uint16_t VIR13H;
            struct {
              __IO uint8_t VIR13HL;
              __IO uint8_t VIR13HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR14;
        struct {
          union {
            __IO uint16_t VIR14L;
            struct {
              __IO uint8_t VIR14LL;
              __IO uint8_t VIR14LH;
            };
          };
          union {
            __IO uint16_t VIR14H;
            struct {
              __IO uint8_t VIR14HL;
              __IO uint8_t VIR14HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR15;
        struct {
          union {
            __IO uint16_t VIR15L;
            struct {
              __IO uint8_t VIR15LL;
              __IO uint8_t VIR15LH;
            };
          };
          union {
            __IO uint16_t VIR15H;
            struct {
              __IO uint8_t VIR15HL;
              __IO uint8_t VIR15HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR16;
        struct {
          union {
            __IO uint16_t VIR16L;
            struct {
              __IO uint8_t VIR16LL;
              __IO uint8_t VIR16LH;
            };
          };
          union {
            __IO uint16_t VIR16H;
            struct {
              __IO uint8_t VIR16HL;
              __IO uint8_t VIR16HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR17;
        struct {
          union {
            __IO uint16_t VIR17L;
            struct {
              __IO uint8_t VIR17LL;
              __IO uint8_t VIR17LH;
            };
          };
          union {
            __IO uint16_t VIR17H;
            struct {
              __IO uint8_t VIR17HL;
              __IO uint8_t VIR17HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR18;
        struct {
          union {
            __IO uint16_t VIR18L;
            struct {
              __IO uint8_t VIR18LL;
              __IO uint8_t VIR18LH;
            };
          };
          union {
            __IO uint16_t VIR18H;
            struct {
              __IO uint8_t VIR18HL;
              __IO uint8_t VIR18HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR19;
        struct {
          union {
            __IO uint16_t VIR19L;
            struct {
              __IO uint8_t VIR19LL;
              __IO uint8_t VIR19LH;
            };
          };
          union {
            __IO uint16_t VIR19H;
            struct {
              __IO uint8_t VIR19HL;
              __IO uint8_t VIR19HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR20;
        struct {
          union {
            __IO uint16_t VIR20L;
            struct {
              __IO uint8_t VIR20LL;
              __IO uint8_t VIR20LH;
            };
          };
          union {
            __IO uint16_t VIR20H;
            struct {
              __IO uint8_t VIR20HL;
              __IO uint8_t VIR20HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR21;
        struct {
          union {
            __IO uint16_t VIR21L;
            struct {
              __IO uint8_t VIR21LL;
              __IO uint8_t VIR21LH;
            };
          };
          union {
            __IO uint16_t VIR21H;
            struct {
              __IO uint8_t VIR21HL;
              __IO uint8_t VIR21HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR22;
        struct {
          union {
            __IO uint16_t VIR22L;
            struct {
              __IO uint8_t VIR22LL;
              __IO uint8_t VIR22LH;
            };
          };
          union {
            __IO uint16_t VIR22H;
            struct {
              __IO uint8_t VIR22HL;
              __IO uint8_t VIR22HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR23;
        struct {
          union {
            __IO uint16_t VIR23L;
            struct {
              __IO uint8_t VIR23LL;
              __IO uint8_t VIR23LH;
            };
          };
          union {
            __IO uint16_t VIR23H;
            struct {
              __IO uint8_t VIR23HL;
              __IO uint8_t VIR23HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR24;
        struct {
          union {
            __IO uint16_t VIR24L;
            struct {
              __IO uint8_t VIR24LL;
              __IO uint8_t VIR24LH;
            };
          };
          union {
            __IO uint16_t VIR24H;
            struct {
              __IO uint8_t VIR24HL;
              __IO uint8_t VIR24HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR25;
        struct {
          union {
            __IO uint16_t VIR25L;
            struct {
              __IO uint8_t VIR25LL;
              __IO uint8_t VIR25LH;
            };
          };
          union {
            __IO uint16_t VIR25H;
            struct {
              __IO uint8_t VIR25HL;
              __IO uint8_t VIR25HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR26;
        struct {
          union {
            __IO uint16_t VIR26L;
            struct {
              __IO uint8_t VIR26LL;
              __IO uint8_t VIR26LH;
            };
          };
          union {
            __IO uint16_t VIR26H;
            struct {
              __IO uint8_t VIR26HL;
              __IO uint8_t VIR26HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR27;
        struct {
          union {
            __IO uint16_t VIR27L;
            struct {
              __IO uint8_t VIR27LL;
              __IO uint8_t VIR27LH;
            };
          };
          union {
            __IO uint16_t VIR27H;
            struct {
              __IO uint8_t VIR27HL;
              __IO uint8_t VIR27HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR28;
        struct {
          union {
            __IO uint16_t VIR28L;
            struct {
              __IO uint8_t VIR28LL;
              __IO uint8_t VIR28LH;
            };
          };
          union {
            __IO uint16_t VIR28H;
            struct {
              __IO uint8_t VIR28HL;
              __IO uint8_t VIR28HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR29;
        struct {
          union {
            __IO uint16_t VIR29L;
            struct {
              __IO uint8_t VIR29LL;
              __IO uint8_t VIR29LH;
            };
          };
          union {
            __IO uint16_t VIR29H;
            struct {
              __IO uint8_t VIR29HL;
              __IO uint8_t VIR29HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR30;
        struct {
          union {
            __IO uint16_t VIR30L;
            struct {
              __IO uint8_t VIR30LL;
              __IO uint8_t VIR30LH;
            };
          };
          union {
            __IO uint16_t VIR30H;
            struct {
              __IO uint8_t VIR30HL;
              __IO uint8_t VIR30HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR31;
        struct {
          union {
            __IO uint16_t VIR31L;
            struct {
              __IO uint8_t VIR31LL;
              __IO uint8_t VIR31LH;
            };
          };
          union {
            __IO uint16_t VIR31H;
            struct {
              __IO uint8_t VIR31HL;
              __IO uint8_t VIR31HH;
            };
          };
        };
    };
} FM_VIR_TypeDef, FM0P_VIR_TypeDef;

